In [1]:
import pandas as pd
import boto3
import json
import configparser

In [2]:
%load_ext sql

In [3]:
config = configparser.ConfigParser()
config.read_file(open('dwh.cfg'))

HOST= config.get("CLUSTER","HOST")
DB_NAME= config.get("CLUSTER","DB_NAME")
DB_USER= config.get("CLUSTER","DB_USER")
DB_PASSWORD= config.get("CLUSTER","DB_PASSWORD")
DB_PORT = config.get("CLUSTER","DB_PORT")

### Create a connection to the database

In [4]:
import os 
conn_string="postgresql://{}:{}@{}:{}/{}".format(DB_USER, DB_PASSWORD, HOST, DB_PORT,DB_NAME)
print(conn_string)
%sql $conn_string

postgresql://dwhuser:Passw0rd@dwhcluster.clgw9jdsvqmj.us-west-2.redshift.amazonaws.com:5439/dwh

'Connected: dwhuser@dwh'

### Here we have the representation of our Star Schema with one fact table and four dimension tables coming from it.

`Table Name: songplays
column: songplay_id
column: start_time
column: user_id
column: level
column: song_id
column: artist_id
column: session_id
column: location
column: user_agent`

`Table Name: users
column: user_id
column: first_name
column: last_name
column: gender
column: level`

`Table Name: songs
column: song_id
column: title
column: artist_id
column: year
column: duration`

`Table Name: artists
column: artist_id
column: name
column: location
column: latitude
column: longitude`

`Table Name: time
column: start_time
column: hour
column: day
column: week
column: month
column: year
column: weekday`

<img src="images/StarSchema.png" width="750">

## Now we will run some queries on this database to analyze the Sparkify.

#### The first information we want about the Sparkify is understand the main artists and songs.

#### Top 10 artists

In [5]:
%%sql
SELECT 
    COUNT(songplays.songplay_id),
    artists.name 
FROM songplays 
INNER JOIN artists ON songplays.artist_id = artists.artist_id
GROUP BY artists.name
ORDER BY COUNT(songplay_id) DESC 
LIMIT 10;

 * postgresql://dwhuser:***@dwhcluster.clgw9jdsvqmj.us-west-2.redshift.amazonaws.com:5439/dwh
10 rows affected.

[(37, 'Dwight Yoakam'),
 (10, 'Kid Cudi / Kanye West / Common'),
 (9, 'Ron Carter'),
 (9, 'Lonnie Gordon'),
 (8, 'B.o.B'),
 (6, 'Usher featuring Jermaine Dupri'),
 (6, 'Muse'),
 (5, 'Arctic Monkeys'),
 (4, 'Metallica'),
 (4, 'matchbox twenty')]

## Top 10 locations where the Sparkify is used

In [6]:
%%sql
SELECT 
    COUNT(songplay_id), 
    location 
FROM songplays 
GROUP BY location 
ORDER BY COUNT(songplay_id) DESC 
LIMIT 10;

 * postgresql://dwhuser:***@dwhcluster.clgw9jdsvqmj.us-west-2.redshift.amazonaws.com:5439/dwh
10 rows affected.

[(41, 'San Francisco-Oakland-Hayward, CA'),
 (31, 'Portland-South Portland, ME'),
 (28, 'Lansing-East Lansing, MI'),
 (20, 'Waterloo-Cedar Falls, IA'),
 (18, 'Tampa-St. Petersburg-Clearwater, FL'),
 (17, 'Sacramento--Roseville--Arden-Arcade, CA'),
 (17, 'Atlanta-Sandy Springs-Roswell, GA'),
 (15, 'Chicago-Naperville-Elgin, IL-IN-WI'),
 (13, 'Lake Havasu City-Kingman, AZ'),
 (11, 'Janesville-Beloit, WI')]

### We can see how is the Sparkify's users by gender. It's possible to see a little more women using the program.

In [7]:
%%sql
SELECT 
    COUNT(user_id), 
    gender 
FROM users 
GROUP BY gender;

 * postgresql://dwhuser:***@dwhcluster.clgw9jdsvqmj.us-west-2.redshift.amazonaws.com:5439/dwh
2 rows affected.

[(44, 'M'), (60, 'F')]

### But even with a similar number of users, women use much more than men

In [9]:
%%sql
SELECT 
    COUNT(songplays.songplay_id), 
    users.gender 
FROM songplays 
INNER JOIN users ON songplays.user_id = users.user_id 
GROUP BY users.gender;

 * postgresql://dwhuser:***@dwhcluster.clgw9jdsvqmj.us-west-2.redshift.amazonaws.com:5439/dwh
2 rows affected.

[(225, 'F'), (94, 'M')]

### The Top 10 users confirm that women use more Sparkify than man when we see seven women in top 10

In [10]:
%%sql
SELECT 
    COUNT(songplays.songplay_id), 
    users.last_name, 
    users.first_name, 
    users.gender
FROM songplays 
INNER JOIN users ON songplays.user_id = users.user_id 
GROUP BY users.last_name, users.first_name, users.gender
ORDER BY COUNT(songplays.songplay_id) DESC, users.last_name, users.first_name 
LIMIT 10;

 * postgresql://dwhuser:***@dwhcluster.clgw9jdsvqmj.us-west-2.redshift.amazonaws.com:5439/dwh
10 rows affected.

[(41, 'Cuevas', 'Chloe', 'F'),
 (31, 'Levine', 'Tegan', 'F'),
 (28, 'Harrell', 'Kate', 'F'),
 (20, 'Kirby', 'Aleena', 'F'),
 (18, 'Klein', 'Jacob', 'M'),
 (17, 'Rodriguez', 'Mohammad', 'M'),
 (15, 'Koch', 'Lily', 'F'),
 (13, 'Griffin', 'Layla', 'F'),
 (13, 'Lynch', 'Jacqueline', 'F'),
 (11, 'Jones', 'Matthew', 'M')]

### Other important information is the number of paid and free user using the Sparkify. We can see much more free users

In [11]:
%%sql
SELECT 
    COUNT(user_id), 
    level 
FROM users 
GROUP BY level;

 * postgresql://dwhuser:***@dwhcluster.clgw9jdsvqmj.us-west-2.redshift.amazonaws.com:5439/dwh
2 rows affected.

[(82, 'free'), (22, 'paid')]

### But the paid user are responsable for the most part of the song plays in Sparkify

In [12]:
%%sql 
SELECT 
    COUNT(songplays.songplay_id), 
    users.level 
FROM songplays 
INNER JOIN users ON songplays.user_id = users.user_id 
GROUP BY users.level;

 * postgresql://dwhuser:***@dwhcluster.clgw9jdsvqmj.us-west-2.redshift.amazonaws.com:5439/dwh
2 rows affected.

[(240, 'paid'), (79, 'free')]

### This information is confirmed for Top 10 users because the users who most use the Sparkify are all paid accounts

In [13]:
%%sql 
SELECT 
    COUNT(songplays.songplay_id), 
    users.last_name, 
    users.first_name, 
    users.level
FROM songplays 
INNER JOIN users ON songplays.user_id = users.user_id 
GROUP BY users.last_name, users.first_name, users.level
ORDER BY COUNT(songplays.songplay_id) DESC, users.last_name, users.first_name 
LIMIT 10

 * postgresql://dwhuser:***@dwhcluster.clgw9jdsvqmj.us-west-2.redshift.amazonaws.com:5439/dwh
10 rows affected.

[(41, 'Cuevas', 'Chloe', 'paid'),
 (31, 'Levine', 'Tegan', 'paid'),
 (28, 'Harrell', 'Kate', 'paid'),
 (20, 'Kirby', 'Aleena', 'paid'),
 (18, 'Klein', 'Jacob', 'paid'),
 (17, 'Rodriguez', 'Mohammad', 'paid'),
 (15, 'Koch', 'Lily', 'free'),
 (13, 'Griffin', 'Layla', 'paid'),
 (13, 'Lynch', 'Jacqueline', 'paid'),
 (11, 'Jones', 'Matthew', 'free')]

### So, from this database we could take some conclusions and understand better how the Sparkify is used.